# Homework

## Problem 4

### Import the libraries

#### Import արեք pandas գրադարանը pd  անունով

In [5]:
import pandas as pd
baby_names = pd.read_csv('baby_names.csv')
d.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Import the dataset baby_names.txt, assign it to a variable called baby_names

### Import արեք baby_names.txt dataset-ը ու այն վերագրեք baby_names փոփոխականի

In [ ]:
#Done

### See the first 10 entries.

### Տպեք առաջին 10 արժեքը

In [7]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Delete the columns 'Unnamed: 0' and 'Id'

### Ջնջեք 'Unnamed: 0' ու 'Id' սյուները

In [11]:
baby_names.drop(['Id'], axis=1, inplace=True)
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Are there more male or female names in the dataset?

### Արդյոք dataset-ում ավելի շատ են կանացի թե տղամարդու անունները?

In [12]:
baby_names['Gender'].value_counts()

F    2404
M      99
Name: Gender, dtype: int64

### Delete the column 'Year'. Group the dataset by name and assign to names.

### Ջնջեք 'Year' սյունը. Խմբավորեք dataset-ը ըստ անունի ու վերագրեք արդյունքը names փոփոխականին

In [15]:
baby_names.drop(['Year'], axis=1, inplace=True)
names = baby_names.groupby('Name')

KeyError: "['Year'] not found in axis"

### How many different names exist in the dataset?

### Քանի հատ տարբեր անուն կա dataset-ում?

In [20]:
len(names)

575

### What is the name with most occurrences?

### Որն է ամենաշատ հանդիպող անունը?

In [22]:
baby_names['Name'].value_counts()

Riley        12
Isabel       11
Gabriella    11
Claire       11
Abigail      11
             ..
Joanna        1
Everly        1
Shyla         1
Claudia       1
David         1
Name: Name, Length: 575, dtype: int64

### What is the median name occurrence?

### Որն է անունների հանդիպման մեդիանը՞

In [23]:
names.median()

         Count
Name
Aaliyah   11.0
Aaron     29.0
Abby       6.0
Abigail   37.0
Ada        5.0
...        ...
Wyatt     20.0
Xander    13.0
Zachary   27.0
Zoe       15.0
Zoey      12.0

[575 rows x 1 columns]

### Get a summary with the mean, min, max, std and quartiles.

### Ստացեք dataset-ի ամփոփում mean, min, max, std ու quartile-ներով

In [24]:
baby_names.describe().transpose()

        count       mean       std  min  25%  50%   75%   max
Count  2503.0  11.485018  8.830294  5.0  6.0  8.0  13.0  65.0